data:
  - title: Persistence Via Cron Files
    id: 6c4e2f43-d94d-4ead-b64d-97e53fa2bd05
    status: test
    description: Detects creation of cron file or files in Cron directories which could indicates potential persistence.
    references:
        - https://github.com/microsoft/MSTIC-Sysmon/blob/f1477c0512b0747c1455283069c21faec758e29d/linux/configs/attack-based/persistence/T1053.003_Cron_Activity.xml
    author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
    date: 2021/10/15
    modified: 2022/12/31
    tags:
        - attack.persistence
        - attack.t1053.003
    logsource:
        product: linux
        category: file_event
    detection:
        selection1:
            TargetFilename|startswith:
                - '/etc/cron.d/'
                - '/etc/cron.daily/'
                - '/etc/cron.hourly/'
                - '/etc/cron.monthly/'
                - '/etc/cron.weekly/'
                - '/var/spool/cron/crontabs/'
        selection2:
            TargetFilename|contains:
                - '/etc/cron.allow'
                - '/etc/cron.deny'
                - '/etc/crontab'
        condition: 1 of selection*
    falsepositives:
        - Any legitimate cron file.
    level: medium
    paths:
      sigma: https://github.com/octodemo/dac-rules/blob/main/rules/sigma/file_event_lnx_persistence_cron_files.yml
      splunk: https://github.com/octodemo/dac-rules/blob/main/rules/splunk/file_event_lnx_persistence_cron_files.yml
  - title: Linux Base64 Encoded Shebang In CLI
    id: fe2f9663-41cb-47e2-b954-8a228f3b9dff
    status: test
    description: Detects the presence of a base64 version of the shebang in the commandline, which could indicate a malicious payload about to be decoded
    references:
        - https://www.trendmicro.com/pl_pl/research/20/i/the-evolution-of-malicious-shell-scripts.html
        - https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS
    author: Nasreddine Bencherchali (Nextron Systems)
    date: 2022/09/15
    tags:
        - attack.defense_evasion
        - attack.t1140
    logsource:
        product: linux
        category: process_creation
    detection:
        selection:
            CommandLine|contains:
                - "IyEvYmluL2Jhc2" # Note: #!/bin/bash"
                - "IyEvYmluL2Rhc2" # Note: #!/bin/dash"
                - "IyEvYmluL3pza" # Note: #!/bin/zsh"
                - "IyEvYmluL2Zpc2" # Note: #!/bin/fish
                - "IyEvYmluL3No" # Note: # !/bin/sh"
        condition: selection
    falsepositives:
        - Legitimate administration activities
    level: medium
    paths:
      sigma: https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_base64_shebang_cli.yml
  - title: Communication To Ngrok Tunneling Service - Linux
    id: 19bf6fdb-7721-4f3d-867f-53467f6a5db6
    status: test
    description: Detects an executable accessing an ngrok tunneling endpoint, which could be a sign of forbidden exfiltration of data exfiltration by malicious actors
    references:
        - https://twitter.com/hakluke/status/1587733971814977537/photo/1
        - https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
    author: Florian Roth (Nextron Systems)
    date: 2022/11/03
    tags:
        - attack.exfiltration
        - attack.command_and_control
        - attack.t1567
        - attack.t1568.002
        - attack.t1572
        - attack.t1090
        - attack.t1102
        - attack.s0508
    logsource:
        product: linux
        category: network_connection
    detection:
        selection:
            DestinationHostname|contains:
                - 'tunnel.us.ngrok.com'
                - 'tunnel.eu.ngrok.com'
                - 'tunnel.ap.ngrok.com'
                - 'tunnel.au.ngrok.com'
                - 'tunnel.sa.ngrok.com'
                - 'tunnel.jp.ngrok.com'
                - 'tunnel.in.ngrok.com'
        condition: selection
    falsepositives:
        - Legitimate use of ngrok
    level: high
  - title: Potentially Suspicious Shell Script Creation in Profile Folder
    id: 13f08f54-e705-4498-91fd-cce9d9cee9f1
    status: experimental
    description: Detects the creation of shell scripts under the "profile.d" path.
    references:
        - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
        - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
        - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
        - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
    author: Joseliyo Sanchez, @Joseliyo_Jstnk
    date: 2023/06/02
    tags:
        - attack.persistence
    logsource:
        product: linux
        category: file_event
    detection:
        selection:
            TargetFilename|contains: '/etc/profile.d/'
            TargetFilename|endswith:
                - '.csh'
                - '.sh'
        condition: selection
    falsepositives:
        - Legitimate shell scripts in the "profile.d" directory could be common in your environment. Apply additional filter accordingly via "image", by adding specific filenames you "trust" or by correlating it with other events.
        - Regular file creation during system update or software installation by the package manager
    level: low # Can be increased to a higher level after some tuning
